/**************************************************************************************************
 FUTABA_SBUS.H

 Заголовочный файл протокола FUTABA SBUS

 Разработчик: Подлесный Василий
**************************************************************************************************/

#pragma once

#include "stm32f10x_usart.h"
#include "stm32f10x_dma.h"
#include "stdlib.h"

/**************************************************************************************************
                                          ЛОКАЛЬНЫЕ МАКРОСЫ
**************************************************************************************************/
#define BAUDRATE	    100000					// скорость последовательного порта 91408 до 95780. от 94800 до 95600 - 95200
#define USART			USART2					// выбор uart

#define PIN_RX			GPIO_Pin_3				// пин приема данных по uart
#define PIN_TX			GPIO_Pin_2				// пин передачи данных по uart

#define SBUS_PacketSize 25						// размер пакета SBUS протокола
#define	SBUS_ChannelSize 16						// размер массива значений, заносимых в каналы управления

/**************************************************************************************************
                                          МАКРОСЫ ДЛЯ РАБОТЫ КОПТЕРА
**************************************************************************************************/
#define VALUE_MIN	352
#define VALUE_MAX	1696	
#define VALUE_ZERO	1024
	
/**************************************************************************************************
                                   ПРОТОТИПЫ ГЛОБАЛЬНЫХ ФУНКЦИЙ
**************************************************************************************************/
void InitSBUSuart(void);
void SendSBUS(uint8_t* buf, uint32_t len);
void MakeSBUSmsg(uint8_t* buf, uint16_t* channelValues);
void MakeChannelPacket(uint16_t* channelValues);
void StartStopMotor(uint16_t* channelValues);
void PreparePosMotor(uint16_t* channelValues);

