/**************************************************************************************************
 TIMER_SERVICE.H

 Заголовочный файл службы времени
   
 Разработчик: Подлесный Василий
**************************************************************************************************/

#pragma once

#include "stm32f10x_tim.h"
#include "futaba_sbus.h"

/**************************************************************************************************
                                          ЛОКАЛЬНЫЕ МАКРОСЫ
**************************************************************************************************/
#define PRESCALER			720-1				// предделитель таймера(72 000 000/720 = 100 000)
#define PERIOD			1400-1					// период отсчета таймера(1400/100 000 = 0,014 с = 14 мс)


/**************************************************************************************************
                                   ПРОТОТИПЫ ГЛОБАЛЬНЫХ ФУНКЦИЙ
**************************************************************************************************/
void InitTimer(void);
void SysTick_Handler(void);
void TimingDelay_Decrement(void);
void Delay(__IO uint32_t nTime);
