/**************************************************************************************************
 TIMER_SERVICE.H

 Заголовочный файл службы времени
   
 Разработчик: Подлесный Василий
**************************************************************************************************/

#pragma once

#include "stm32f10x_tim.h"
#include "futaba_sbus.h"

/**************************************************************************************************
                                          ЛОКАЛЬНЫЕ МАКРОСЫ
**************************************************************************************************/
#define PRESCALER			800-1				// предделитель таймера(72 000 000/720 = 100 000)___предделитель таймера(8 000 000/800 = 10 000)
#define PERIOD				140-1					// период отсчета таймера(1400/100 000 = 0,014 с = 14 мс)____период отсчета таймера(140/10 000 = 0,014 с = 14 мс)

#define PRESCALER_PAUSE			8000-1				// предделитель таймера(72 000 000/7200 = 10 000)___предделитель таймера(8 000 000/8000 = 1000)
#define PERIOD_PAUSE			5000-1					// период отсчета таймера(5000/1000 = 1 с = 1000 мс)

/**************************************************************************************************
                                   ПРОТОТИПЫ ГЛОБАЛЬНЫХ ФУНКЦИЙ
**************************************************************************************************/
void InitTimer(void);
void InitTimerPause(void);
void SysTick_Handler(void);
void TimingDelay_Decrement(void);
void Delay(__IO uint32_t nTime);
