/**************************************************************************************************
 TIMER_SERVICE.C

 Служба времени
   
 Пакеты данных отправляются с интервалом в 14 мс.
 Задержка реализовывается на таймере SysTick либо на прерываниях таймера общего назначения.
 
 Используется TIM4.
 
 Разработчик: Подлесный Василий
**************************************************************************************************/

#include "timerService.h"

/**************************************************************************************************
                                          ВНЕШНИЕ ПЕРЕМЕННЫЕ
**************************************************************************************************/
extern uint8_t SBUSDataMessage[SBUS_PacketSize];		// пакет SBUS протокола
extern int16_t SBUSChannelValues[SBUS_ChannelSize];		// массива значений, заносимых в каналы управления

/**************************************************************************************************
                                       ГЛОБАЛЬНЫЕ ПЕРЕМЕННЫЕ
**************************************************************************************************/
static volatile uint32_t TimingDelay;

/**************************************************************************************************
                                        ГЛОБАЛЬНЫЕ ФУНКЦИИ
**************************************************************************************************/

/**************************************************************************************************
Описание:  Обеспечивает задержку
Аргументы: Время задержки в миллисекундах
Возврат:   Нет
Замечания: 
**************************************************************************************************/
void Delay(__IO uint32_t nTime)
{
	TimingDelay = nTime;
	while(TimingDelay != 0); 
}

/**************************************************************************************************
Описание:  Декремент занчений счетчика таймера
Аргументы: Нет
Возврат:   Нет
Замечания: 
**************************************************************************************************/
void TimingDelay_Decrement(void)
{
	if (TimingDelay != 0x00)
	{
		TimingDelay--;
	}
}

/**************************************************************************************************
Описание:  Обработчик прерываний от системного таймера
Аргументы: Нет
Возврат:   Нет
Замечания: 
**************************************************************************************************/
void SysTick_Handler(void) 
{
	TimingDelay_Decrement();
}

/**************************************************************************************************
Описание:  Инициализация таймера общего назначения
Аргументы: Нет
Возврат:   Нет
Замечания:
**************************************************************************************************/
void InitTimer(void)
{
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM4, ENABLE);

	TIM_TimeBaseInitTypeDef timer;
	TIM_TimeBaseStructInit(&timer);
	timer.TIM_Prescaler = PRESCALER;
	timer.TIM_Period = PERIOD;
	TIM_TimeBaseInit(TIM4, &timer);
	
	TIM_ITConfig(TIM4, TIM_IT_Update, ENABLE);
	TIM_Cmd(TIM4, ENABLE);
	NVIC_EnableIRQ(TIM4_IRQn);
}

/**************************************************************************************************
Описание:  Обработчик прерываний по таймеру TIM4
Аргументы: Нет
Возврат:   Нет
Замечания:
**************************************************************************************************/
void TIM4_IRQHandler()
{
	TIM_ClearITPendingBit(TIM4, TIM_IT_Update);
	
	MakeSBUSmsg((uint8_t*)SBUSDataMessage, (int16_t*)SBUSChannelValues);
	SendSBUS((uint8_t*)SBUSDataMessage, sizeof(SBUSDataMessage) );
}
